Repository: AIDoit-2026/MediaForge
Catalog: src/MediaForge.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# TemporarySession.Title
source: Temporary session
zh_hans: 当前为临时会话

# TemporarySession.Message
source: The config folder cannot be written. This session uses defaults; settings, queue, and logs will not be saved.
zh_hans: 无法写入 config 文件夹。本次将使用默认参数，设置、队列和日志不会保存。

# Navigation.Conversion
source: Convert
zh_hans: 转换

# Navigation.Presets
source: Presets
zh_hans: 预设

# Navigation.Settings
source: Settings
zh_hans: 设置

# Conversion.Title
source: Convert
zh_hans: 转换

# Conversion.AddFiles
source: Add files
zh_hans: 添加文件

# Conversion.AddFolder
source: Add folder
zh_hans: 添加文件夹

# Conversion.Start
source: Start conversion
zh_hans: 开始转换

# Conversion.Clear
source: Clear queue
zh_hans: 清空队列

# Conversion.EmptyTitle
source: Add media files to start converting
zh_hans: 添加媒体文件以开始转换

# Conversion.EmptyDescription
source: Multiple selection, drag and drop, and filtered folder imports are supported.
zh_hans: 支持多选、拖放和按条件导入文件夹。

# Settings.Title
source: Settings
zh_hans: 设置

source: Settings saved.
zh_hans: 设置已保存。

# Settings.CannotPersist
source: This temporary session cannot save settings.
zh_hans: 当前临时会话无法保存设置。

# Settings.InvalidConcurrency
source: Maximum concurrency must be between 1 and 4.
zh_hans: 最大并行数必须在 1 到 4 之间。

# Settings.CorruptRecovered
source: A corrupt settings file was backed up and defaults were restored.
zh_hans: 检测到损坏的设置文件，已备份并恢复默认设置。

# SettingsTitle.Text
source: Settings
zh_hans: 设置

# SettingsDescription.Text
source: Changes are saved in the config folder beside the application.
zh_hans: 更改会保存到程序目录旁的 config 文件夹。

# LanguageLabel.Text
source: Language
zh_hans: 语言

# SystemLanguageOption.Content
source: System default
zh_hans: 跟随系统

# ChineseLanguageOption.Content
source: Simplified Chinese
zh_hans: 简体中文

# ThemeLabel.Text
source: Theme
zh_hans: 主题

# SystemThemeOption.Content
source: System default
zh_hans: 跟随系统

# LightThemeOption.Content
source: Light
zh_hans: 浅色

# DarkThemeOption.Content
source: Dark
zh_hans: 深色

# FfmpegDirectoryLabel.Text
source: FFmpeg directory
zh_hans: FFmpeg 目录

# FfmpegDirectoryTextBox.PlaceholderText
source: Empty: check the directory containing MediaForge.exe
zh_hans: 留空时检查 MediaForge.exe 所在目录

source: FFmpeg directory
zh_hans: FFmpeg 目录

# DefaultOutputDirectoryLabel.Text
source: Default output directory
zh_hans: 默认输出目录

# DefaultOutputDirectoryTextBox.PlaceholderText
source: Empty: chosen by each conversion job
zh_hans: 留空时由转换任务决定

source: Default output directory
zh_hans: 默认输出目录

# ConflictPolicyLabel.Text
source: Name conflict
zh_hans: 同名文件

# SkipConflictOption.Content
source: Skip
zh_hans: 跳过

# OverwriteConflictOption.Content
source: Overwrite
zh_hans: 覆盖

# RenameConflictOption.Content
source: Auto rename
zh_hans: 自动重命名

# MaxConcurrencyLabel.Text
source: Maximum concurrent jobs
zh_hans: 最大并行数

# SaveButton.Content
source: Save settings
zh_hans: 保存设置

# ConversionTitle.Text
source: Convert
zh_hans: 转换

# AddFilesButton.Label
source: Add files
zh_hans: 添加文件

# AddFolderButton.Label
source: Add folder
zh_hans: 添加文件夹

# StartButton.Label
source: Start conversion
zh_hans: 开始转换

# ClearButton.Label
source: Clear queue
zh_hans: 清空队列

# EmptyTitle.Text
source: Add media files to start converting
zh_hans: 添加媒体文件以开始转换

# EmptyDescription.Text
source: Multiple selection, drag and drop, and filtered folder imports are supported.
zh_hans: 支持多选、拖放和按条件导入文件夹。

# PresetsTitle.Text
source: Presets
zh_hans: 预设

# PresetsDescription.Text
source: Built-in presets are read-only; you can create your own later.
zh_hans: 内置预设为只读；后续可创建自己的预设。

# FolderImport.Title
source: Import folder
zh_hans: 导入文件夹

# FolderImport.Import
source: Import
zh_hans: 导入

# FolderImport.Cancel
source: Cancel
zh_hans: 取消

# FolderImport.Folder
source: Folder
zh_hans: 文件夹

# FolderImport.FolderPlaceholder
source: Choose a folder to scan
zh_hans: 选择要扫描的文件夹

# FolderImport.Recursive
source: Include subfolders
zh_hans: 包含子文件夹

# FolderImport.Filter
source: Filter
zh_hans: 过滤方式

# FolderImport.AllFiles
source: All files
zh_hans: 所有文件

# FolderImport.Keyword
source: Keyword
zh_hans: 关键字

# FolderImport.Wildcard
source: Wildcard (* and ?)
zh_hans: 通配符（* 和 ?）

# FolderImport.RegularExpression
source: Regular expression
zh_hans: 正则表达式

# FolderImport.Expression
source: Expression
zh_hans: 表达式

# FolderImport.DirectoryRequired
source: Choose an existing folder.
zh_hans: 请选择一个存在的文件夹。

# Preset.NoVideo
source: No video
zh_hans: 无视频

# Preset.NoAudio
source: No audio
zh_hans: 无音频

# Conversion.ToolsNotFound
source: FFmpeg or FFprobe was not found.
zh_hans: 未找到 FFmpeg 或 FFprobe。

# Conversion.UnsupportedFile
source: Unsupported file
zh_hans: 不支持的文件

# Conversion.UnknownDuration
source: Unknown duration
zh_hans: 时长未知

# Conversion.UnsupportedFeature
source: This FFmpeg build does not support '{0}'. Update or replace FFmpeg before starting conversion.
zh_hans: 当前 FFmpeg 构建不支持“{0}”。请更新或更换 FFmpeg 后再开始转换。

# Conversion.ToolValidationPassed
source: FFmpeg supports the selected conversion settings.
zh_hans: FFmpeg 支持当前选择的转换设置。

# Conversion.NoFilesToQueue
source: There are no media files to add to the conversion queue.
zh_hans: 没有可加入转换队列的媒体文件。

# Conversion.Queued
source: Queued
zh_hans: 已加入队列

# Conversion.QueuedCount
source: Added {0} job(s) to the conversion queue.
zh_hans: 已将 {0} 个任务加入转换队列。

# Conversion.CannotClearRunning
source: The queue cannot be cleared while conversion is running.
zh_hans: 正在转换时无法清空队列。

# Conversion.Output
source: Output: {0}
zh_hans: 输出：{0}

# Conversion.Status.Ready
source: Ready
zh_hans: 准备就绪

# Conversion.Status.Queued
source: Queued
zh_hans: 等待转换

# Conversion.Status.Running
source: Converting
zh_hans: 正在转换

# Conversion.Status.Succeeded
source: Completed
zh_hans: 已完成

# Conversion.Status.Failed
source: Failed
zh_hans: 转换失败

# Conversion.Status.Interrupted
source: Interrupted
zh_hans: 已中断

# Conversion.Status.Skipped
source: Skipped
zh_hans: 已跳过

# Conversion.ProgressUnknown
source: Progress unavailable
zh_hans: 进度未知

# Conversion.Elapsed
source: elapsed
zh_hans: 已用

# Conversion.Remaining
source: about remaining
zh_hans: 剩余约

# Conversion.OverallProgress
source: Overall: {0}/{1} finished, {2:F0}%
zh_hans: 总进度：{0}/{1} 已结束，{2:F0}%

# Application.Exit
source: Exit application
zh_hans: 退出应用

# Application.Tray.Open
source: Open window
zh_hans: 打开主窗口

# Application.Tray.Exit
source: Exit application
zh_hans: 退出应用
